Дано:
Fib(0) = 0
Fib(1) = 1
Fib(n) = Fib(n-1) + Fib(n-2), при n>1
φ = (1 + sqrt(5))/2
ψ = (1 - sqrt(5))/2

Используя индукцию и определение числа фибоначчи докажем что
Fib(n) = (φ^n − ψ^n)/sqrt(5).   (утв.А)

Для n=1, n=2 формула верна
Fib(1) = (φ^1 − ψ^1)/sqrt(5) = ((1 + sqrt(5))/2 - (1 - sqrt(5))/2) / sqrt(5) =  1
Fib(2) = (φ^2 − ψ^2)/sqrt(5) = (((1 + sqrt(5))/2)^2 - ((1 - sqrt(5))/2)^2) / sqrt(5) = ((1 + sqrt(5))/2 - (1 - sqrt(5))/2)*((1 + sqrt(5))/2 + (1 - sqrt(5))/2) / sqrt(5) = 1 

Допустим, что при n=k (k>2) формула верна 
Fib(k) = (φ^k − ψ^k)/sqrt(5)
и также верна при n=k+1 и n=k-1
Fib(k+1) = (φ^(k+1) − ψ^(k+1))/sqrt(5),
Fib(k-1) = (φ^(k-1) − ψ^(k-1))/sqrt(5)

Тогда по определению фибоначчи
Fib(k+1) = Fib(k) + Fib(k-1)
должно быть верно тождество после подстановки:

(φ^(k+1) − ψ^(k+1))/sqrt(5) = (φ^k − ψ^k)/sqrt(5) + (φ^(k-1) − ψ^(k-1))/sqrt(5)
Докажем это
φ^(k+1) − ψ^(k+1) = φ^k − ψ^k + φ^(k-1) − ψ^(k-1)
φ*φ^k − ψ*ψ^k = φ^k − ψ^k + φ^k/φ − ψ^k/ψ
(φ-1)*φ^k − (ψ-1)*ψ^k = φ^k/φ − ψ^k/ψ
Будет верно при одновременно:
(φ-1)= 1/φ и
(ψ-1)= 1/ψ.
Или
(φ-1)φ= 1 и
(ψ-1)ψ= 1.
Сделаем подстановку
((1 + sqrt(5))/2 - 1) * (1 + sqrt(5))/2 = 1  и
((1 - sqrt(5))/2 - 1) * (1 - sqrt(5))/2 = 1
Или
(-1 + sqrt(5))/2 * (1 + sqrt(5))/2 = 1  и
(-1 - sqrt(5))/2 * (1 - sqrt(5))/2 = 1
Или
(5-1)/4 = 1 и
-(1-5)/4 =1.

Таким образом утверждение А верно.
_______

Докажем, что Fib(n) есть целое число, ближайшее к φ^n / sqrt(5), где φ = (1 + sqrt(5))/2.
Из доказанного утверждения А следует, что
|Fib(n) - φ^n / sqrt(5)| = |ψ^n / sqrt(5) |
ψ^n / sqrt(5) < 1/2 для всех n>=0, тогда φ^n / sqrt(5) ближайшее к целому Fib(n).